In [1]:
import numpy as np
import pandas as pd

In [6]:
data = {
    'Date': pd.date_range('2023-01-01', periods=20),
    'Product': ['A', 'B', 'C', 'D'] * 5,
    'Region': ['East', 'West', 'North', 'South'] * 5,
    'Sales': np.random.randint(100, 1000, 20),
    'Units':np.random.randint(10,100,20),
    'Rep':['John','Mary','Bob','Alic']*5
}
df=pd.DataFrame(data)
df['Month']=df['Date'].dt.month_name()
df['Quater']='Q'+df['Date'].dt.quarter.astype(str)
df

         Date Product Region  Sales  Units   Rep    Month Quater
0  2023-01-01       A   East    744     62  John  January     Q1
1  2023-01-02       B   West    230     24  Mary  January     Q1
2  2023-01-03       C  North    376     19   Bob  January     Q1
3  2023-01-04       D  South    796     18  Alic  January     Q1
4  2023-01-05       A   East    582     68  John  January     Q1
5  2023-01-06       B   West    540     20  Mary  January     Q1
6  2023-01-07       C  North    523     66   Bob  January     Q1
7  2023-01-08       D  South    375     68  Alic  January     Q1
8  2023-01-09       A   East    158     39  John  January     Q1
9  2023-01-10       B   West    282     15  Mary  January     Q1
10 2023-01-11       C  North    137     86   Bob  January     Q1
11 2023-01-12       D  South    859     65  Alic  January     Q1
12 2023-01-13       A   East    379     53  John  January     Q1
13 2023-01-14       B   West    545     94  Mary  January     Q1
14 2023-01-15       C  North    691     21   Bob  January     Q1
15 2023-01-16       D  South    474     15  Alic  January     Q1
16 2023-01-17       A   East    307     32  John  January     Q1
17 2023-01-18       B   West    558     56  Mary  January     Q1
18 2023-01-19       C  North    795     47   Bob  January     Q1
19 2023-01-20       D  South    214     96  Alic  January     Q1

In [7]:
pd.pivot_table(df,values='Sales',index='Region',columns='Product')

Product      A      B      C      D
Region
East     434.0    NaN    NaN    NaN
North      NaN    NaN  504.4    NaN
South      NaN    NaN    NaN  543.6
West       NaN  431.0    NaN    NaN

In [8]:
pd.pivot_table(df,values='Sales',index='Region',columns='Product',aggfunc='median')

Product      A      B      C      D
Region
East     379.0    NaN    NaN    NaN
North      NaN    NaN  523.0    NaN
South      NaN    NaN    NaN  474.0
West       NaN  540.0    NaN    NaN

In [9]:
pivot2=pd.pivot_table(df,values=['Sales','Units'],index='Region',columns='Product')
pivot2

         Sales                      Units
Product      A      B      C      D     A     B     C     D
Region
East     434.0    NaN    NaN    NaN  50.8   NaN   NaN   NaN
North      NaN    NaN  504.4    NaN   NaN   NaN  47.8   NaN
South      NaN    NaN    NaN  543.6   NaN   NaN   NaN  52.4
West       NaN  431.0    NaN    NaN   NaN  41.8   NaN   NaN

In [ ]:
#Cross Tabs

In [10]:
pd.crosstab(df['Region'],df['Product'])

Product  A  B  C  D
Region
East     5  0  0  0
North    0  0  5  0
South    0  0  0  5
West     0  5  0  0